---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.TooManyFacesEdges
source: html/36329a50-eb36-e4aa-88f3-f32c36a39725.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.TooManyFacesEdges Property

This family instance has too many [Edges and Faces]. Remove unnecessary geometry or split the instance into multiple instances.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooManyFacesEdges { get; }
```